[LanguageDefinition]

LanguageID = English

Title = "Digital Wizard's Lab world editor v"

B_AddLayer = "Add layer"
L_X = "X:"
L_Y = "Y:"
L_Width = "Width:"
L_Height = "Height:"
L_DX = "DX:"
L_DY = "DY:"
L_Shape = "Shape:"
L_Angle = "Angle:"
L_Velocity = "Velocity:"
L_Alpha = "Alpha:"
L_Red = "Red:"
L_Green = "Green:"
L_Blue = "Blue:"
L_XScale = "XScale:"
L_YScale = "YScale:"
L_VisDX = "VisDX:"
L_VisDY = "VisDY:"
L_Frame = "Frame:"
B_SelectImage = "Select image"
CB_Rotation = "Rot."
CB_Scaling = "Sc."
L_ImageAngle = "ImgAngle:"

M_File = "File"
M_New = "New project"
M_Open = "Open project..."
M_Save = "Save project..."
M_SaveAs = "Save project as..."
M_Exit = "Exit"
M_Edit = "Edit"
M_ShowCollisions = "Show collision shapes"
M_ShowVectors = "Show vectors"
M_ShowNames = "Show names"
M_ShowGrid = "Show grid"
M_SnapToGrid = "Snap to grid"
M_GridSettings = "Grid settings"
M_StaticModel = "Static model"
M_VectorModel = "Vector model"
M_AngularModel = "Angular model"
M_ReplacementOfTiles = "Replacement of tiles"
M_ProlongTiles = "Prolong tiles"
M_Language = "Language"
M_English = "English"
M_Russian = "Russian"

M_Select = "Select"
M_AddLayer = "Add new layer"
M_AddTilemap = "Add new tilemap"
M_ImportTilemap = "Import tilemap"
M_ImportTilemaps = "Import tilemaps"
M_RemoveBounds = "Remove bounds"
M_EditTilemap = "Edit"
M_ToggleVisibility = "Toggle visibility (V)"
M_ToggleActivity = "Toggle activity (A)"
M_ResizeTileMap = "Resize"
M_SelectTileset = "Select tileset"
M_EditTileReplacementRules = "Edit tile replacement rules"
M_SetBounds = "Set as bounds of current layer"
M_Rename = "Rename"
M_ShiftToTheTop = "Shift to the top (Home)"
M_ShiftUp = "Shift up (PgUp)"
M_ShiftDown = "Shift down (PgDn)"
M_ShiftToTheBottom = "Shift to the bottom (End)"
M_Remove = "Remove"

D_UnsavedWorld = "Your world is not saved, would you like to save it now?"
D_SelectFileNameToSave = "Select world file name to save..."
D_SelectFileNameToOpen = "Select world file name to open..."

D_EnterNameOfObject = "Enter name of the object"
D_EnterNameOfLayer = "Enter name of the new layer:"
D_EnterNameOfTilemap = "Enter name of the new tilemap:"

L_TileSize = "tile size"
L_Pixels = "pixels"
D_SelectTilemapFile = "Select tilemap file to process..."
D_SelectTilemapsDirectory = "Select directory with tilemap files to process..."
D_SelectFileToSaveImageTo = "Select file to save tiles image to..."
N_CannotLoadTilemap = "Cannot load tilemap."
N_TilemapSize = "Tilemap size must be divideable by tile size."

I_Pivot = "Pivot"
I_Circle = "Circle"
I_Rectangle = "Rectangle"

L_TilesQuantity = "tiles quantity"
L_Tiles = "tiles"
L_Choose = "Choose"

B_OK = "OK"
B_Cancel = "Cancel"

W_TilesetRulesEditor = "Tileset replacement rules editor"
B_AddCategory = "Add category"
M_RenameCategory = "Rename"
M_CopyCategory = "Copy"
M_RemoveCategory = "Remove"
M_AddTileRule = "Add tile rule"
M_RemoveTileRule = "Remove"
M_ShiftTileRuleUp = "Shift up (PgUp)"
M_ShiftTileRuleDown = "Shift down (PgDown)"
L_XDivider = "XDivider:"
L_YDivider = "YDivider:"
D_EnterTileShift = "Enter tile shift"
D_EnterNameOfNewCategory = "Enter name of the new category"
D_EnterNameOfCategory = "Enter name of category"
D_TilemapDataLoss = "Some of tilemap data may be lost, are you sure you want to continue?"

W_ImageProperties = "Image properties"
N_MustBeMoreZero = " must be more than 0"
B_LoadImage = "Load image"
D_SelectImage = "Select image... "
N_ImageDivideable = "Image sizes must be divideable by tile cells quantity"
N_TileCellsQuantityMoreThanZero = "Tile cells quantity must be more than 0"

W_SpriteImage = "Sprite image selection"
L_Image = "Image:"
B_Add = "Add"
B_Modify = "Modify"
B_Remove = "Remove"

W_TilemapTileset = "Tileset selection for tilemap"
L_Tileset = "Tileset:"

W_GridSettings = "Grid settings"
L_CellWidth = "Cell width:"
L_CellHeight = "Cell height:"
L_VerticalCellDivision = "Vertical cell division:"
L_HorizontalCellDivision = "Horizontal cell division:"
B_SelectColor = "Select color"

W_ResizeTilemap = "Change tilemap size"
L_HorizontalCells = "Horizontal cells:"
L_VerticalCells = "Vertical cells:"
L_HorizontalShift = "Horizontal shift:"
L_VerticalShift = "Vertical shift:"